// Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
//5 -> 2, 4
//8 -> 2, 4, 6, 8



// Ввод числа N с клавиатуры
            Console.Write(Console"Введите число : "); 

            int N = int.Parse(Console.ReadLine());

            // Перебор чисел от 1 до N.

            for (int i = 1; i <= N; i++);

            // Проверка на чётность
                
               
            if (i % 2 == 0)
                {
                    Console.WriteLine(result);
                }

                {
                    Console.WriteLine(result);
                }

                {
                    Console.WriteLine(result);
                }



